# -*- coding: utf-8 -*-
"""
Задание 17.5a

Создать сопрограмму (coroutine) log_device_configuration.
Сопрограмма log_device_configuration должна использовать configure_router
из задания 17.5 для настройки оборудования. Оборудование должно настраиваться
параллельно.

После настройки оборудования, log_device_configuration должна записывать
результаты в log-файл (все результаты записываются в один log-файл):
* если настройка прошла успешно, записать в файл строку "Успешно настроен 192.168.100.1",
  а затем записать результат, который вернула configure_router
* если настройка не прошла проверку, записать в файл строку
  "Не получилось настроить 192.168.100.1" и записать сообщение из исключения

Параметры функции log_device_configuration:

* log_file - имя файла, в который будут записываться сообщения (сообщения могут быть в любом порядке)
* devices - список словарей с параметрами подключения к устройствам
* device_commands_map - словарь в котором указано на какое устройство
  отправлять какие команды. Пример словаря - commands

Пример команд и словаря для проверки настройки есть в задании.

При необходимости, можно использовать функции из предыдущих заданий
и создавать дополнительные функции.

Для заданий в этом разделе нет тестов!
"""

ospf = [
    "router ospf 55",
    "auto-cost reference-bandwidth 1000000",
    "network 0.0.0.0 255.255.255.255 area 0",
]
logging_with_error = "logging 0255.255.1"
logging_correct = "logging buffered 20010"

commands = {
    "192.168.100.2": logging_correct,
    "192.168.100.3": logging_with_error,
    "192.168.100.1": ospf,
}
