# -*- coding: utf-8 -*-
"""
Задание 1.6

Написать тест(ы), который проверяет находятся ли все интерфейсы, которые указаны
в файле net_interfaces_up.yaml в состоянии up (например, столбец Protocol в выводе sh ip int br).

Для проверки надо подключиться к каждому маршрутизатору, который указан
в файле net_interfaces_up.yaml с помощью scrapli/netmiko и проверить статус
интерфейсов. Можно использовать параметры из devices_reachable.yaml.

Тест(ы) должен проходить, если все интерфейсы из файла net_interfaces_up.yaml в состоянии up.
Тест может быть один или несколько. Файл net_interfaces_up.yaml можно менять - писать другие
интерфейсы или IP-адреса, главное чтобы формат оставался таким же.

Тест(ы) написать в файле задания.

Для заданий этого раздела нет тестов для проверки тестов :)
"""
