# -*- coding: utf-8 -*-
'''
Задание 18.2

Создать сопрограмму (coroutine) ping_ip_addresses, которая проверяет
пингуются ли IP-адреса в списке.
Проверка IP-адресов должна выполняться параллельно (concurrent).

Функция ожидает как аргумент список IP-адресов.

Функция должна возвращать кортеж с двумя списками:

* список доступных IP-адресов
* список недоступных IP-адресов


Для проверки доступности IP-адреса, используйте утилиту ping встроенную в ОС.

Запустить сопрограмму и проверить, что она работает корректно.
При необходимости можно создавать дополнительные функции.

Для заданий в этом разделе нет тестов!

'''
